ciniml/serial_wifi_logger/sdkconfig.defaults
# Target Configuration
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# WiFi Provisioning
CONFIG_NETWORK_PROV_NETWORK_TYPE_WIFI=y
CONFIG_PROV_SECURITY_VERSION_1=y
CONFIG_PROV_POP_CODE="abcd1234"
CONFIG_WIFI_MAXIMUM_RETRY=5
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y

# OTA Partition Configuration
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_TWO_OTA=n
CONFIG_PARTITION_TABLE_SINGLE_APP=n

# Bootloader Rollback Support
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_NUM_PIN_APP_TEST=0

# Compiler Optimization (Size reduction for OTA partitions)
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# HTTP Server Configuration
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_WS_SUPPORT=n

# lwIP: Enable LWIP_ESP_NETIF_DATA so netif->state is available for raw lwIP
# netifs (e.g. WireGuard) without conflicting with esp_netif's internal pointer.
# Without this, esp_netif_internal_dhcpc_cb() casts netif->state as esp_netif_t*
# and crashes when WireGuard stores its own device context there.
# CONFIG_LWIP_PPP_SUPPORT triggers LWIP_ESP_NETIF_DATA=1 in lwipopts.h;
# no PPP interface is actually created — this is purely a build-time switch.
CONFIG_LWIP_PPP_SUPPORT=y

# Tailscale / WireGuard: increase max peers for managed mode.
# Tailscale tailnets can have many peers; we accept the SRAM cost (~800 B each).
CONFIG_WIREGUARD_MAX_PEERS=16

# TLS CA store: needed for HTTPS connections to login.tailscale.com and DERP servers
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Increase TLS handshake buffer for large certificates from CDN-hosted DERP servers
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# Custom UART configuration for logging
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y
CONFIG_ESP_CONSOLE_UART=y
CONFIG_ESP_CONSOLE_UART_CUSTOM_NUM_0=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_ROM_SERIAL_PORT_NUM=0
CONFIG_ESP_CONSOLE_UART_TX_GPIO=1
CONFIG_ESP_CONSOLE_UART_RX_GPIO=2
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200